'''
4 5
1 1 0 0 0
1 1 0 0 0
0 0 1 0 0
0 0 0 1 1

result = [
    [1,1,0,0,0],
    [1,1,0,0,0],
    [0,0,1,0,0],
    [0,0,0,1,1]
]
# 注释+测试
计划有一个二维数组result,result 存储的是一行一行的数据,比如[1,1,0,0,0]
i=0次循环:[[1, 1, 0, 0, 0]]
i=1次循环:[[1, 1, 0, 0, 0], [1, 1, 0, 0, 0]]
i=2次循环:[[1, 1, 0, 0, 0], [1, 1, 0, 0, 0], [0, 0, 1, 0, 0]]
i=3次循环:[[1, 1, 0, 0, 0], [1, 1, 0, 0, 0], [0, 0, 1, 0, 0], [0, 0, 0, 1]]
最终结果result = [
    [1, 1, 0, 0, 0], 
    [1, 1, 0, 0, 0], 
    [0, 0, 1, 0, 0], 
    [0, 0, 0, 1, 1], 
    [0, 0, 0, 1, 1]
]
'''
result = []
firstData = list(map(int, input().split(' ')))
for i in range(firstData[0]):
    item = list(map(int, input().split(' ')))
    result.append(item)
print(result)

'''
3 3
S#.
.#.
..G
'''