def f3(n):  # n问题规模
    dp = [0] * (n + 1)
    dp[1] = 1
    dp[2] = 2
    for i in range(3, n + 1):
        dp[i] = dp[i - 1] + dp[i - 2]
    return dp[n]


'''
[
    [0, 1, 4, 0, 0], 
    [0, 0, 0, 7, 0], 
    [0, 2, 5, 0, 9], 
    [0, 0, 0, 8, 0], 
    [0, 3, 6, 0, 0]
]
[
    [ , 1, 4,  ,  ], 
    [ ,  ,  , 7,  ], 
    [0, 2, 5,  , 9], 
    [ ,  ,  , 8,  ], 
    [ , 3, 6,  ,  ]
]
'''
import math
N, K = 10, 5  # 有向图10顶点,5个阶段
S = [[0], [1, 2, 3], [4, 5, 6], [7, 8], [9]]  # 邻接矩阵
A = [
    [0,2,4,3,"1","1","1","1","1","1"],
    ["1",0,"1","1",7,4,"1","1","1","1"],
    ["1","1",0,"1",3,2,4,"1","1","1"],
    ["1","1","1",0,6,2,5,"1","1","1"],
    ["1","1","1","1",0,"1","1",3,4,"1"],
    ["1","1","1","1","1",0,"1",6,3,"1"],
    ["1","1","1","1","1","1",0,3,3,"1"],
    ["1","1","1","1","1","1","1",0,"1",3],
    ["1","1","1","1","1","1","1","1",0,4],
    ["1","1","1","1","1","1","1","1","1",0]
]
def mindist2(start, end):  # 从start开始到end结束最短的管道长度---最短路径问题
    dp = [[0] * N for i in range(K)] # N列K行
    # print(dp)
    dp[0][start] = 0 # 0阶段初始为0
    # 循环K个阶段
    for k in range(1,K):# 从阶段1到阶段K-1,也就是1-4
        # 对每个阶段求解,每个阶段中又有多个顶点,意味着你要对每个顶点出发都要求长度
        # print(S[k])
         # i就代表第小k个阶段的每个顶点,比如小k为=1,S[k]=[1,2,3],len(S[k])=3,
         # 那么i就是0,1,2,分别代表1阶段中的1/2/3这三个顶点
        for i in range(0,len(S[k])):
        # for i in S[k]: # 如果这样写i就等同于S[k][i]
            # print(S[k][i]) # 达到了在每个阶段循环遍历当前阶段中的不同顶点
            xk = S[k][i] # xk就是小k阶段中的每一个顶点i
            for j in range(0,N): # 假设xk为顶点2,它需要遍历从它出发能到的所有顶点,一共10个
                # print(A[j][xk])
                # A[j][xk] != 0不是自己到自己(避免环路),
                # A[j][xk] != INF 可以去的地方
                if A[j][xk] != 0 and str(A[j][xk]) != "1": # 如果这两个条件同时满足,说明一个顶点指向它的非自身的出度点
                    # 算当前的dp[k][xk]
                    dp[k][xk] = min(dp[k][xk],dp[k-1][j] + A[j][xk])
    return dp[4][end]

result = mindist2(0, 9)
print(result)


# S1 = {"0": [0], "1": [1, 2, 3], "2": [4, 5, 6], "3": [7, 8], "4": [9]}  # 邻接表
# result = f3(10)
# print(result)

"""
# [0, 0, 0, 0, 0, 0] 列表

[
    [0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0]
]

row = 3
col = 6

[[0, 0, 0, 0, 0, 0]]
"""
# dp = [0] * (5 + 1)
# print(dp) # [0, 0, 0, 0, 0, 0] 列表
# row = 3
# col = 3
# dp2 = [[0] * (col + 1) for i in range(row)]
# print(dp2)
